var posts_content = [{
    date: "Nov 20 2016",
    title: "正是虾肥蟹壮时",
    post_img: "/image-posts/crab.png",
    avatar_img: "/image-posts/4.png",
    content: "我们常说的大闸蟹，双螯处有如墨绒毛团，其余六爪呈金黄色，腿毛稀疏，挺拔有力，配上曲爪弯钩，看起来攻击力十足。其实蟹是否好吃，分辨起来甚是简单。好的大闸蟹养殖区，选择在水库上游敞水区域或者河流入水口的两侧一带，因为这一区域避开了主河道，水域开阔、水质良好没污染。",
    see_img: "/image-posts/view.png",
    star_img: "/image-posts/chat.png",
    see_num: 0,
    star_num: 0,
    author: "毛毛",
    detail_content: "很久以前,在一条河流边,一只小螃蟹出生了。\n当时的它,只长有两只脚。面对这个新奇的世界,螃蟹对一切都充满了好奇。\n它来到沙滩上, 迈着两只小脚, 走来走去, 很是高兴。它遇到了一只乌龟, 刚要和它打招呼, 可乌龟却坏极了, 伸出它的长脖子, 一下就把螃蟹顶翻了。螃蟹爬起来去追乌龟, 可它只有两只脚, 怎么也追不上长着四只脚的乌龟。螃蟹气坏了, 气喘吁吁地停在一棵树下休息。\n这时, 来了一只蜈蚣。螃蟹看到它全身竟然长满了脚, 而且经过时, 它的一只脚不小心碰了自己一下, 就有毒汁刺来, 让人受不了。螃蟹不干了, 它再三乞求上帝多给它长几只脚。上帝说, 我只能满足你的一次要求, 你可要想清楚, 不要后悔。螃蟹心想, “八”是大家喜欢的吉利数, 自己就要八只脚吧, 免得以后受别人欺负。上帝答应了它的要求。\n第二天, 一早醒来, 螃蟹高兴地看到自己果真长出了八只脚。它太兴奋了, 可它很快就沮丧地发现, 自己竟然不会走路了。由于长的脚突然增多, 当它往前走时, 怎么也无法让那些脚协调一致地朝前行走, 而是前后交叉在一起, 像打架一般, 引来了众多旁观者的嘲笑。这下, 它后悔不已, 可却无法改变眼前的一切。痛苦的螃蟹经过一段日子的苦苦探索, 终于想出了办法: 既然不能直着走, 那就横着走吧。很快, 横着走的螃蟹成了大家眼里不一样的风景。\n可见, 我们不要只想着羡慕别人的风景, 而要对自己所拥有的感到满足; 如果一旦面临无法改变的事实时, 就要勇于面对, 善于创新, 这样才会有新出路。",
    postId: 0,
    music: {
      url: "http://113.207.48.23/amobile.music.tc.qq.com/C400004LsnWB3uGI28.m4a?guid=9431743179&vkey=5E8AB5DFAC3D24F271622270C0D509509CB6C71DB27AEE535526B08257E48712F83D90BD51A9BFD0089B1B0E5A770FDAC6F2513CDF18C47B&uin=6910&fromtag=66",
      title: "不染-翻唱（原唱-毛不易）",
      coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000000sJdQb0ojDhj.jpg?max_age=2592000"
    }
  },
  {
    date: "Sep 25 2016",
    title: "比利·林恩的中场战事",
    post_img: "/image-posts/bl.png",
    avatar_img: "/image-posts/2.png",
    content: "该片讲述了在伊拉克战争中的美国士兵比利·林恩与战友战胜归来并被誉为美国英雄，在一场橄榄球公开赛的中场表演过程中，揭露这群士兵在战场上真实经历的故事。",
    see_img: "/image-posts/view.png",
    star_img: "/image-posts/chat.png",
    see_num: 0,
    star_num: 0,
    author: "豆瓣",
    detail_content: "对于林恩来说，人们最想听的那段他“封雄”事迹，正是他最痛苦、不肯回首的精力。因为他失去最好的心灵导师蘑菇。而人们似乎从没有意思一点，或者故意忽略这一点，让主角反反复复的陈述他们想听到的精彩。这里体现人性中一种深刻的冷漠，他们只关心故事，因为这是他们从未体验过和经历过的，而他们却从为关心过他们所奉为“英雄”本人--------------- 这是对人性的一次讽刺。同时在电影的诸多环节中，我们很少看到人们对于“英雄“”所谓的尊重，无论是拍电影的费用、中场表演的情景、看表演的观众。这里反应的是——虚伪的人性。更具体的说，之所以有英雄，不是因为英雄真的是英雄，而是人们需要一个英雄而已............而如果让你们去做这个英雄，你会觉得傻子才会去做。 即便主角也是因为犯了罪，才去的战场。而电影中描述，当英雄回来的那天，有的不再是荣誉，人们早已经淡忘，而英雄还要为生计而愁.......这也是人性中的善变、健忘的特性。所以我们常说感恩、感恩、感恩。正因为我们经常忘记感恩...在整部电影中，人们很少关心“蘑菇”这个已死去之人——这是人性中的另一种悲哀。当然电影中也有温情的一面，如主角的艳遇。而这条线主要传递似乎是这样一个道理;”玩玩可以，玩真的不行“这是英雄最后的福利，也是短期的。——人性的现实关于这场战争的意义，也讲了真话。通过富人和大兵接触的片段进行了呈现。——这个就是美式的虚伪。“”邪恶化对手，彰显自己的正义“实则是——人性的贪婪”作怪。军人只是其工具而已...英雄只是愚民的精神符号而已，而英雄的本身就是一种最大的讽刺。",
    postId: 1,
    music: {
      url: "http://117.172.5.149/amobile.music.tc.qq.com/C40000007eNI1Xv7V4.m4a?guid=9431743179&vkey=1D5EB465A8D2960FC90E38CEEA2C6DA98ABDCA5ED26A573B672AC598686F6103D3B7CB57F8EE4CE68F0ABC3BE528DAD4BE82B55273E605A8&uin=0&fromtag=66",
      title: "Lemon Tree-Fool's Gargen",
      coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000001HpCMz0UiGX4.jpg?max_age=2592000"
    }
  },
  {
    date: "Mar 20 2019",
    title: "比悲伤更悲伤的故事",
    post_img: "/image-posts/sorrow.jpg",
    avatar_img: "/image-posts/sorrow_avatar.jpg",
    content: "唱片制作人张哲凯（刘以豪饰）和王牌作词人宋媛媛（陈意涵饰）相依为命，两人自幼身世坎坷只有彼此为伴，他们是亲人、是朋友，也彷佛是命中注定的另一半。父亲罹患遗传重症而被母亲抛弃的哲凯，深怕自己随时会发病不久人世，始终没有跨出友谊的界线对媛媛展露爱意。",
    see_img: "/image-posts/view.png",
    star_img: "/image-posts/chat.png",
    see_num: 0,
    star_num: 0,
    author: "百度",
    detail_content: "在一起工作的电台制作人的姜哲奎（权相宇饰）和作词人恩媛（李宝英饰），都是身世可怜的人，一个从小失去父亲，被母亲遗影片剧照弃，另一个因交通意外而痛失双亲。两个同病相怜的人走在了一起，都把对方看成自己的家人、朋友和亲人，以此弥补了生活里的空缺，彼此相爱，彼此信赖，慢慢地将遗憾放在了一边，生活得简简单单却也充满快乐。但哲奎自己知道他因为得了绝症，不久将离开人世。他实在是舍不得留下恩媛一个人，他走了恩媛就会一个人在这世界上，无依无靠。于是，他隐瞒了自己的病情，同时暗暗做出了一个决定，那就是用他剩下的时间为恩媛寻找一个可以替他照顾洛琳一生一世的男人。一个聪明、通情达理而又温柔体贴的医生朱焕（李范秀饰）适时的出现了，恩媛似乎爱上了朱焕。在哲奎眼里，他是最有可能带给恩媛一生的幸福。所以他尽自己最大的努力来实现他的愿望。于是，在哲奎的精心设计下，恩媛和朱焕顺利发展着感情。好像一切都在意料中发展下去，而看着心爱的人在自己的一手安排下走向另一个人，也给哲奎带来了巨大的悲伤，哲奎只有悄悄地将它隐藏了起来。最后，哲奎带着深深的留恋和真挚的祝福亲自为恩媛挑选了结婚礼服，一步一步牵着她走向教堂。也许因为有幸福的映托，悲伤显得益发悲伤。但是，一切都是为了幸福，一切都又因幸福拒绝悲伤。那个时候你知道吗？爱情不是用手而是用心来抚摸。望着故事的一幕幕，这一切又真是哲奎安排好的吗，还是...事实上，故事，远比这里所写的更悲伤......",
    postId: 2,
    music: {
      url: "http://112.19.6.22/amobile.music.tc.qq.com/C400003D2Q1v2bwV0o.m4a?guid=9431743179&vkey=83284098E80B7C288C3E8913664ECFA804C61DAB7B2E3C24B3EC4936B9B9FF4EB70CEDD538BF5AFA73D37A46158E5CF688D05756A14DBD38&uin=0&fromtag=66",
      title: "比悲伤更悲伤的故事-朱习爱",
      coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000001Bh9UX4SnUg4.jpg?max_age=2592000"
    }
  },
  {
    date: "Jan 01 2019",
    title: "疯狂的外星人",
    post_img: "/image-posts/alien.jpg",
    avatar_img: "/image-posts/alien_avatar.jpg",
    content: "耿浩（黄渤饰）与一心想发大财的好兄弟大飞（沈腾饰），经营着各自惨淡的“事业”，然而“天外来客”的意外降临，打破了二人平静又拮据的生活。神秘的西方力量也派出“哼哈二将”在全球寻找外星人踪影。啼笑皆非的跨物种对决，别开生面的“星战”，在中国某海边城市激情上演。",
    see_img: "/image-posts/view.png",
    star_img: "/image-posts/chat.png",
    see_num: 0,
    star_num: 0,
    author: "搜狗",
    detail_content: "号称银河系最先进的外星文明试图和地球建交，谁知一连串的误会导致意外发生。外星使者的飞船坠入大气层，最终摔在了中国某市的世界公园中。靠耍猴戏为生的耿浩（黄渤 饰）和酒贩子好友大飞（沈腾 饰）把受伤的外星人错认为来自南美洲的猴子，在自家猴子受伤的情况下，耿浩开始训练起这个他口中的“刚果骚骚猴”来了。由于失去了超能力加成设备，外星人的本事无法施展，只能任由这两个傻乎乎的地球人打骂操练。尽管如此，他仍试图夺回自己的装备。另一方面，之前与外星人交流失败的超级大国根据外星人留下的信息，穿梭世界各地寻找外星使者。地球的命运朝着不可预测的方向发展……",
    postId: 3,
    music: {
      url: "http://183.222.96.22/amobile.music.tc.qq.com/C400000RxHNy1WqRH1.m4a?guid=9431743179&vkey=E7E4CEF29E01B66F470D276CE0CE4C5F47FDD633CA20B9CD209FCD9D9E64106803B06B93C55C50604358BFCABEA47804FCC438134A2EA0E0&uin=0&fromtag=66",
      title: "银河系Disco-火箭少女101",
      coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000001bO2VY23yfoo.jpg?max_age=2592000",
    }
  },
  {
    date: "Mar 26 2019",
    title: "《撒野》 巫哲",
    post_img: "/image-posts/saYe.jpg",
    avatar_img: "/image-posts/saYe_avatar.jpg",
    content: "酷帅的年级第一学霸vs深藏不露钢厂小霸王。蒋丞因为与养父养母之间的矛盾被送回了自己出生的城市，去面对一个有血缘却陌生的父亲及一个残破的家庭。在最郁闷无助的时候遇见了顾飞。顾飞是钢厂区的霸王，学校里的老大。他表面看起来冷漠不羁，但真的是很善良有责任感，独自撑起一个家照顾妹妹和老妈。",
    see_img: "/image-posts/view.png",
    star_img: "/image-posts/chat.png",
    see_num: 0,
    star_num: 0,
    author: "归去来兮",
    detail_content: "故事开始于蒋丞被退养回原籍。从大城市到小城市，从重点学校到几乎成了职高的普高，从干净小康的领养家庭到混乱肮脏的亲生家庭。从蒋丞眼中，勾勒出依靠重工业生存的污浊空气下的北方小城。破败的厂房、混乱的胡同、挣扎的人群、淡薄的亲情。蒋丞从心底厌恶这个地方。他从到达开始，就只想逃离。他与这个地方没有一丝一毫的联结与相似，也没有一丝一毫的喜爱和留恋。直到一连串的巧合让他与顾飞牵手成功（雾）。他本是彻底的孤儿，因为顾飞而终于在此处长出根系。“你是我的后背，没有你，我整个人是空的。”蒋丞目标明确，有一种天上地下老子最大的自信，有一种“倔强但不幼稚的天真”，无论是谨慎设定的计划还是一时冲动的目的，他都相信自己能实现并会拼尽全力实现。也是蒋丞，率先从两人之间的暧昧迈入爱情。“你想不想……交个男朋友？”顾飞才华横溢，但背负着家庭的重担，自闭症的妹妹和当甩手掌柜的母亲让他宁愿在泥淖中不睁开眼睛。他用“刺儿头”的形象包裹他会摄影会写歌的文艺多情的灵魂，从来不去参加集体活动也不让自己接受他人的目光。他以为自己会在这里腐烂，直到蒋丞对他伸出手。其实几乎是顺理成章的，两个优秀的人之间的相互吸引。高二到高三的甜蜜的充满回忆的一年匆匆而过，带来故事的突破与高潮。蒋丞成绩优异，离开是必然的选择；而顾飞却必须背负家庭，他认为自己无法逃脱，他不想因自己给蒋丞带来负担。两人的世界开始分离。当顾飞看到蒋丞因妹妹顾淼的病而疲惫憔悴时，他崩溃了。他松开了手。“算了吧。”但蒋丞没有。他知道顾飞不是放弃了爱情，而是放弃了自己。故事的转机，是蒋丞寻求心理医生的介入。顾飞不想失去蒋丞，所以他第一次试着走出这一方囹圄。曾经他以为蒋丞的未来没有他，他在两人共同的生日时许下的愿望是，希望蒋丞以后回忆起这段日子时没有遗憾。而现在，他的愿望是蒋丞和他在一起这辈子没有遗憾。“你在哪儿，我就去哪儿。”顾飞是蒋丞的后背与依靠。于是此去经年，故乡不再面目可憎。蒋丞是顾飞的骄傲与勇气。于是明天过后，未来不再暗淡无光。叛逆者加诸羁绊，顾虑者摆脱枷锁。所以尽可以在对方眼中，撒野奔跑。",
    postId: 4,
    music: {
      url: "http://113.207.48.12/amobile.music.tc.qq.com/C400004Ij7Jk3Zt6PF.m4a?guid=9431743179&vkey=0C0FA4C5A1B794E3429D220D7FF8138BCBBD0D2985A337EE027C7391C686FAA4A9DE4130C06AE8D33578DCA92AE58C70E82BDC105F0CD0D7&uin=6910&fromtag=66",
      title: "撒野-奇然/沈谧仁",
      coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000000dUfjA4YAUBS.jpg?max_age=2592000"
    }
  }
];

// var a=2;

// 定义一个数据的出口，别的文件才能访问此文件中的数据
module.exports = {
  postList: posts_content,
  // a_key:a
}